# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, 
# причем кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом,
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод,
# которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.
import random

print("Введите число кустов: ")
n = int(input())
array = [random.randint(15, 40) for i in range(n)]
print(array)
max = array[-2] + array[-1] + array[0]
position = n-1
for i in range(n-1):
    a = array[i-1] + array[i] + array[i+1]
    if a == max:
        max = a
        position = i

print(f"Максимальное колличество ягод которое можно собрать = {max} находясь напротив {position+1} куста.")

